zephyrproject-rtos/hal_silabs/simplicity_sdk/platform/service/device_manager/devices/sl_device_peripheral_hal_efr32xg2d.c
 #if defined(FSRCO_BASE)
// Define peripheral FSRCO.
const sl_peripheral_val_t sl_peripheral_val_fsrco = { .base = FSRCO_BASE,
                                                      .clk_branch = SL_CLOCK_BRANCH_INVALID,
                                                      .bus_clock = SL_BUS_CLOCK_FSRCO };
 #endif

 #if defined(GPCRC_BASE)
// Define peripheral GPCRC0.
const sl_peripheral_val_t sl_peripheral_val_gpcrc0 = { .base = GPCRC_BASE,
                                                       .clk_branch = SL_CLOCK_BRANCH_PCLK,
                                                       .bus_clock = SL_BUS_CLOCK_GPCRC0 };
 #endif

 #if defined(GPIO_BASE)
// Define peripheral GPIO.
const sl_peripheral_val_t sl_peripheral_val_gpio = { .base = GPIO_BASE,
                                                     .clk_branch = SL_CLOCK_BRANCH_PCLK,
                                                     .bus_clock = SL_BUS_CLOCK_GPIO };
 #endif

 #if defined(HFRCO0_BASE)
// Define peripheral HFRCO0.
const sl_peripheral_val_t sl_peripheral_val_hfrco0 = { .base = HFRCO0_BASE,
                                                       .clk_branch = SL_CLOCK_BRANCH_INVALID,
                                                       .bus_clock = SL_BUS_CLOCK_HFRCO0 };
 #endif

 #if defined(HFRCOEM23_BASE)
// Define peripheral HFRCOEM23.
const sl_peripheral_val_t sl_peripheral_val_hfrcoem23 = { .base = HFRCOEM23_BASE,
                                                          .clk_branch = SL_CLOCK_BRANCH_INVALID,
                                                          .bus_clock = SL_BUS_CLOCK_HFRCOEM23 };
 #endif

 #if defined(HFXO0_BASE)
// Define peripheral HFXO0.
const sl_peripheral_val_t sl_peripheral_val_hfxo0 = { .base = HFXO0_BASE,
                                                      .clk_branch = SL_CLOCK_BRANCH_INVALID,
                                                      .bus_clock = SL_BUS_CLOCK_HFXO0 };
 #endif

 #if defined(HOSTMAILBOX_BASE)
// Define peripheral HOSTMAILBOX.
const sl_peripheral_val_t sl_peripheral_val_hostmailbox = { .base = HOSTMAILBOX_BASE,
                                                            .clk_branch = SL_CLOCK_BRANCH_PCLK,
                                                            .bus_clock = SL_BUS_CLOCK_HOSTMAILBOX };
 #endif

 #if defined(I2C0_BASE)
// Define peripheral I2C0.
const sl_peripheral_i2c_val_t sl_peripheral_val_i2c0 = { .base = I2C0_BASE,
                                                         .clk_branch = SL_CLOCK_BRANCH_LSPCLK,
                                                         .bus_clock = SL_BUS_CLOCK_I2C0,
                                                         .dma_signal_rxdatav = SL_DMA_SIGNAL_I2C0_RXDATAV,
                                                         .dma_signal_txbl = SL_DMA_SIGNAL_I2C0_TXBL };
 #endif

 #if defined(I2C1_BASE)
// Define peripheral I2C1.
const sl_peripheral_i2c_val_t sl_peripheral_val_i2c1 = { .base = I2C1_BASE,
                                                         .clk_branch = SL_CLOCK_BRANCH_PCLK,
                                                         .bus_clock = SL_BUS_CLOCK_I2C1,
                                                         .dma_signal_rxdatav = SL_DMA_SIGNAL_I2C1_RXDATAV,
                                                         .dma_signal_txbl = SL_DMA_SIGNAL_I2C1_TXBL };
 #endif

 #if defined(IADC0_BASE)
// Define peripheral IADC0.
const sl_peripheral_iadc_val_t sl_peripheral_val_iadc0 = { .base = IADC0_BASE,
                                                           .clk_branch = SL_CLOCK_BRANCH_IADCCLK,
                                                           .bus_clock = SL_BUS_CLOCK_IADC0,
                                                           .dma_signal_scan = SL_DMA_SIGNAL_IADC0_SCAN,
                                                           .dma_signal_single = SL_DMA_SIGNAL_IADC0_SINGLE };
 #endif

 #if defined(ICACHE0_BASE)
// Define peripheral ICACHE0.
const sl_peripheral_val_t sl_peripheral_val_icache0 = { .base = ICACHE0_BASE,
                                                        .clk_branch = SL_CLOCK_BRANCH_INVALID,
                                                        .bus_clock = SL_BUS_CLOCK_ICACHE0 };
 #endif

 #if defined(KEYSCAN_BASE)
// Define peripheral KEYSCAN.
const sl_peripheral_val_t sl_peripheral_val_keyscan = { .base = KEYSCAN_BASE,
                                                        .clk_branch = SL_CLOCK_BRANCH_EM01GRPACLK,
                                                        .bus_clock = SL_BUS_CLOCK_KEYSCAN };
 #endif

 #if defined(LCD_BASE)
// Define peripheral LCD.
const sl_peripheral_lcd_val_t sl_peripheral_val_lcd = { .base = LCD_BASE,
                                                        .clk_branch = SL_CLOCK_BRANCH_LCDCLK,
                                                        .bus_clock = SL_BUS_CLOCK_LCD,
                                                        .dma_signal_lcd = SL_DMA_SIGNAL_LCD };
 #endif

 #if defined(LCDRF_BASE)
// Define peripheral LCDRF.
const sl_peripheral_val_t sl_peripheral_val_lcdrf = { .base = LCDRF_BASE,
                                                      .clk_branch = SL_CLOCK_BRANCH_PCLK,
                                                      .bus_clock = SL_BUS_CLOCK_INVALID };
 #endif

 #if defined(LDMAXBAR_BASE)
// Define peripheral LDMAXBAR0.
const sl_peripheral_ldmaxbar_val_t sl_peripheral_val_ldmaxbar0 = { .base = LDMAXBAR_BASE,
                                                                   .clk_branch = SL_CLOCK_BRANCH_PCLK,
                                                                   .bus_clock = SL_BUS_CLOCK_LDMAXBAR0,
                                                                   .dma_signal_prsreq0 = SL_DMA_SIGNAL_LDMAXBAR0_PRSREQ0,
                                                                   .dma_signal_prsreq1 = SL_DMA_SIGNAL_LDMAXBAR0_PRSREQ1 };
 #endif

 #if defined(LESENSE_BASE)
// Define peripheral LESENSE.
const sl_peripheral_lesense_val_t sl_peripheral_val_lesense = { .base = LESENSE_BASE,
                                                                .clk_branch = SL_CLOCK_BRANCH_LESENSEHFCLK,
                                                                .bus_clock = SL_BUS_CLOCK_LESENSE,
                                                                .dma_signal_fifo = SL_DMA_SIGNAL_LESENSE_FIFO };
 #endif

 #if defined(LETIMER0_BASE)
// Define peripheral LETIMER0.
const sl_peripheral_val_t sl_peripheral_val_letimer0 = { .base = LETIMER0_BASE,
                                                         .clk_branch = SL_CLOCK_BRANCH_EM23GRPACLK,
                                                         .bus_clock = SL_BUS_CLOCK_LETIMER0 };
 #endif

