zephyrproject-rtos/hal_silabs/simplicity_sdk/platform/service/device_manager/devices/sl_device_peripheral_hal_efr32xg2d.c
 #if defined(LFRCO_BASE)
// Define peripheral LFRCO.
const sl_peripheral_val_t sl_peripheral_val_lfrco = { .base = LFRCO_BASE,
                                                      .clk_branch = SL_CLOCK_BRANCH_INVALID,
                                                      .bus_clock = SL_BUS_CLOCK_LFRCO };
 #endif

 #if defined(LFXO_BASE)
// Define peripheral LFXO.
const sl_peripheral_val_t sl_peripheral_val_lfxo = { .base = LFXO_BASE,
                                                     .clk_branch = SL_CLOCK_BRANCH_INVALID,
                                                     .bus_clock = SL_BUS_CLOCK_LFXO };
 #endif

 #if defined(MSC_BASE)
// Define peripheral MSC.
const sl_peripheral_msc_val_t sl_peripheral_val_msc = { .base = MSC_BASE,
                                                    .clk_branch = SL_CLOCK_BRANCH_HCLK,
                                                    .bus_clock = SL_BUS_CLOCK_MSC,
                                                    .dma_signal_wdata = SL_DMA_SIGNAL_MSC_WDATA };
 #endif

 #if defined(PCNT0_BASE)
// Define peripheral PCNT0.
const sl_peripheral_val_t sl_peripheral_val_pcnt0 = { .base = PCNT0_BASE,
                                                      .clk_branch = SL_CLOCK_BRANCH_PCNT0CLK,
                                                      .bus_clock = SL_BUS_CLOCK_PCNT0 };
 #endif

 #if defined(PFMXPPRF_BASE)
// Define peripheral PFMXPPRF.
const sl_peripheral_val_t sl_peripheral_val_pfmxpprf = { .base = PFMXPPRF_BASE,
                                                         .clk_branch = SL_CLOCK_BRANCH_PCLK,
                                                         .bus_clock = SL_BUS_CLOCK_INVALID };
 #endif

 #if defined(PRS_BASE)
// Define peripheral PRS.
const sl_peripheral_val_t sl_peripheral_val_prs = { .base = PRS_BASE,
                                                    .clk_branch = SL_CLOCK_BRANCH_PCLK,
                                                    .bus_clock = SL_BUS_CLOCK_PRS };
 #endif

 #if defined(RADIOAES_BASE)
// Define peripheral RADIOAES.
const sl_peripheral_val_t sl_peripheral_val_radioaes = { .base = RADIOAES_BASE,
                                                         .clk_branch = SL_CLOCK_BRANCH_INVALID,
                                                         .bus_clock = SL_BUS_CLOCK_RADIOAES };
 #endif

 #if defined(SCRATCHPAD_BASE)
// Define peripheral SCRATCHPAD.
const sl_peripheral_val_t sl_peripheral_val_scratchpad = { .base = SCRATCHPAD_BASE,
                                                           .clk_branch = SL_CLOCK_BRANCH_PCLK,
                                                           .bus_clock = SL_BUS_CLOCK_INVALID };
 #endif

 #if defined(SEMAILBOX_HOST_BASE)
// Define peripheral SEMAILBOX.
const sl_peripheral_val_t sl_peripheral_val_semailbox = { .base = SEMAILBOX_HOST_BASE,
                                                          .clk_branch = SL_CLOCK_BRANCH_HCLK,
                                                          .bus_clock = SL_BUS_CLOCK_SEMAILBOX };
 #endif

 #if defined(SMU_BASE)
// Define peripheral SMU.
const sl_peripheral_val_t sl_peripheral_val_smu = { .base = SMU_BASE,
                                                    .clk_branch = SL_CLOCK_BRANCH_INVALID,
                                                    .bus_clock = SL_BUS_CLOCK_SMU };
 #endif

 #if defined(SYSCFG_BASE)
// Define peripheral SYSCFG.
const sl_peripheral_val_t sl_peripheral_val_syscfg = { .base = SYSCFG_BASE,
                                                       .clk_branch = SL_CLOCK_BRANCH_INVALID,
                                                       .bus_clock = SL_BUS_CLOCK_SYSCFG };
 #endif

 #if defined(SYSRTC0_BASE)
// Define peripheral SYSRTC0.
const sl_peripheral_val_t sl_peripheral_val_sysrtc0 = { .base = SYSRTC0_BASE,
                                                        .clk_branch = SL_CLOCK_BRANCH_SYSRTCCLK,
                                                        .bus_clock = SL_BUS_CLOCK_SYSRTC0 };
 #endif

 #if defined(TIMER0_BASE)
// Define peripheral TIMER0.
const sl_peripheral_timer_val_t sl_peripheral_val_timer0 = { .base = TIMER0_BASE,
                                                             .clk_branch = SL_CLOCK_BRANCH_EM01GRPACLK,
                                                             .bus_clock = SL_BUS_CLOCK_TIMER0,
                                                             .dma_signal_cc0 = SL_DMA_SIGNAL_TIMER0_CC0,
                                                             .dma_signal_cc1 = SL_DMA_SIGNAL_TIMER0_CC1,
                                                             .dma_signal_cc2 = SL_DMA_SIGNAL_TIMER0_CC2,
                                                             .dma_signal_ufof = SL_DMA_SIGNAL_TIMER0_UFOF,
                                                             .dma_signal_cc3 = SL_DMA_SIGNAL_NONE,
                                                             .dma_signal_cc4 = SL_DMA_SIGNAL_NONE,
                                                             .dma_signal_cc5 = SL_DMA_SIGNAL_NONE,
                                                             .dma_signal_cc6 = SL_DMA_SIGNAL_NONE };
 #endif

 #if defined(TIMER1_BASE)
// Define peripheral TIMER1.
const sl_peripheral_timer_val_t sl_peripheral_val_timer1 = { .base = TIMER1_BASE,
                                                             .clk_branch = SL_CLOCK_BRANCH_EM01GRPACLK,
                                                             .bus_clock = SL_BUS_CLOCK_TIMER1,
                                                             .dma_signal_cc0 = SL_DMA_SIGNAL_TIMER1_CC0,
                                                             .dma_signal_cc1 = SL_DMA_SIGNAL_TIMER1_CC1,
                                                             .dma_signal_cc2 = SL_DMA_SIGNAL_TIMER1_CC2,
                                                             .dma_signal_ufof = SL_DMA_SIGNAL_TIMER1_UFOF,
                                                             .dma_signal_cc3 = SL_DMA_SIGNAL_NONE,
                                                             .dma_signal_cc4 = SL_DMA_SIGNAL_NONE,
                                                             .dma_signal_cc5 = SL_DMA_SIGNAL_NONE,
                                                             .dma_signal_cc6 = SL_DMA_SIGNAL_NONE };
 #endif

 #if defined(TIMER2_BASE)
// Define peripheral TIMER2.
const sl_peripheral_timer_val_t sl_peripheral_val_timer2 = { .base = TIMER2_BASE,
                                                             .clk_branch = SL_CLOCK_BRANCH_EM01GRPACLK,
                                                             .bus_clock = SL_BUS_CLOCK_TIMER2,
                                                             .dma_signal_cc0 = SL_DMA_SIGNAL_TIMER2_CC0,
                                                             .dma_signal_cc1 = SL_DMA_SIGNAL_TIMER2_CC1,
                                                             .dma_signal_cc2 = SL_DMA_SIGNAL_TIMER2_CC2,
                                                             .dma_signal_ufof = SL_DMA_SIGNAL_TIMER2_UFOF,
                                                             .dma_signal_cc3 = SL_DMA_SIGNAL_NONE,
                                                             .dma_signal_cc4 = SL_DMA_SIGNAL_NONE,
                                                             .dma_signal_cc5 = SL_DMA_SIGNAL_NONE,
                                                             .dma_signal_cc6 = SL_DMA_SIGNAL_NONE };
 #endif

 #if defined(TIMER3_BASE)
// Define peripheral TIMER3.
const sl_peripheral_timer_val_t sl_peripheral_val_timer3 = { .base = TIMER3_BASE,
                                                             .clk_branch = SL_CLOCK_BRANCH_EM01GRPACLK,
                                                             .bus_clock = SL_BUS_CLOCK_TIMER3,
                                                             .dma_signal_cc0 = SL_DMA_SIGNAL_TIMER3_CC0,
                                                             .dma_signal_cc1 = SL_DMA_SIGNAL_TIMER3_CC1,
                                                             .dma_signal_cc2 = SL_DMA_SIGNAL_TIMER3_CC2,
                                                             .dma_signal_ufof = SL_DMA_SIGNAL_TIMER3_UFOF,
                                                             .dma_signal_cc3 = SL_DMA_SIGNAL_NONE,
                                                             .dma_signal_cc4 = SL_DMA_SIGNAL_NONE,
                                                             .dma_signal_cc5 = SL_DMA_SIGNAL_NONE,
                                                             .dma_signal_cc6 = SL_DMA_SIGNAL_NONE };
 #endif

 #if defined(TIMER4_BASE)
// Define peripheral TIMER4.
const sl_peripheral_timer_val_t sl_peripheral_val_timer4 = { .base = TIMER4_BASE,
                                                             .clk_branch = SL_CLOCK_BRANCH_EM01GRPACLK,
                                                             .bus_clock = SL_BUS_CLOCK_TIMER4,
                                                             .dma_signal_cc0 = SL_DMA_SIGNAL_TIMER4_CC0,
                                                             .dma_signal_cc1 = SL_DMA_SIGNAL_TIMER4_CC1,
                                                             .dma_signal_cc2 = SL_DMA_SIGNAL_TIMER4_CC2,
                                                             .dma_signal_ufof = SL_DMA_SIGNAL_TIMER4_UFOF,
                                                             .dma_signal_cc3 = SL_DMA_SIGNAL_NONE,
                                                             .dma_signal_cc4 = SL_DMA_SIGNAL_NONE,
                                                             .dma_signal_cc5 = SL_DMA_SIGNAL_NONE,
                                                             .dma_signal_cc6 = SL_DMA_SIGNAL_NONE };
 #endif

 #if defined(ULFRCO_BASE)
// Define peripheral ULFRCO.
const sl_peripheral_val_t sl_peripheral_val_ulfrco = { .base = ULFRCO_BASE,
                                                       .clk_branch = SL_CLOCK_BRANCH_INVALID,
                                                       .bus_clock = SL_BUS_CLOCK_ULFRCO };
 #endif

 #if defined(USART0_BASE)
// Define peripheral USART0.
const sl_peripheral_usart_val_t sl_peripheral_val_usart0 = { .base = USART0_BASE,
                                                             .clk_branch = SL_CLOCK_BRANCH_PCLK,
                                                             .bus_clock = SL_BUS_CLOCK_USART0,
                                                             .dma_signal_rxdatav = SL_DMA_SIGNAL_USART0_RXDATAV,
                                                             .dma_signal_rxdatavright = SL_DMA_SIGNAL_USART0_RXDATAVRIGHT,
                                                             .dma_signal_txbl = SL_DMA_SIGNAL_USART0_TXBL,
                                                             .dma_signal_txblright = SL_DMA_SIGNAL_USART0_TXBLRIGHT,
                                                             .dma_signal_txempty = SL_DMA_SIGNAL_USART0_TXEMPTY };
 #endif

