zephyrproject-rtos/hal_silabs/simplicity_sdk/platform/service/device_manager/devices/sl_device_peripheral_hal_efr32xg2d.c
 #if defined(VDAC0_BASE)
// Define peripheral VDAC0.
const sl_peripheral_vdac_val_t sl_peripheral_val_vdac0 = { .base = VDAC0_BASE,
                                                           .clk_branch = SL_CLOCK_BRANCH_VDAC0CLK,
                                                           .bus_clock = SL_BUS_CLOCK_VDAC0,
                                                           .dma_signal_ch0req = SL_DMA_SIGNAL_VDAC0_CH0REQ,
                                                           .dma_signal_ch1req = SL_DMA_SIGNAL_VDAC0_CH1REQ };
 #endif

 #if defined(WDOG0_BASE)
// Define peripheral WDOG0.
const sl_peripheral_val_t sl_peripheral_val_wdog0 = { .base = WDOG0_BASE,
                                                      .clk_branch = SL_CLOCK_BRANCH_WDOG0CLK,
                                                      .bus_clock = SL_BUS_CLOCK_WDOG0 };
 #endif

 #if defined(WDOG1_BASE)
// Define peripheral WDOG1.
const sl_peripheral_val_t sl_peripheral_val_wdog1 = { .base = WDOG1_BASE,
                                                      .clk_branch = SL_CLOCK_BRANCH_WDOG1CLK,
                                                      .bus_clock = SL_BUS_CLOCK_WDOG1 };
 #endif

/** @} (end addtogroup device_peripheral) */

/***************************************************************************//**
 * @addtogroup device_peripheral_dma Device Abstraction DMA Peripheral
 * @{
 ******************************************************************************/

#if defined(LDMA_BASE)
/// Define DMA peripheral LDMA.
const sl_peripheral_dma_val_t sl_peripheral_dma_val_ldma0 = { .base = LDMA_BASE,
                                                              .clk_branch = SL_CLOCK_BRANCH_HCLK,
                                                              .bus_clock = SL_BUS_CLOCK_LDMA0,
                                                              .nbr_channel = 8,
                                                              .nbr_sync = 8,
                                                              .dual_destination_map = 0,
                                                              .rule_based_interleaving_map = 0 };
#endif

/** @} (end addtogroup device_peripheral_dma) */
